app/Http/Middleware/CountVisitor.php

    public function handle(Request $request, Closure $next)
    {
        $admin = (new Controller)->admins;

        // Save ip as a hash
        $ip = hash('sha512', $request->ip());

        // Check if user is going for a redirect
        if (Link::where('input_url', $request->path())->first()) {
            return $next($request);
        }

        // Check if admin
        if (Auth::check()) {
            if (in_array(Auth::user()->name, $admin)) {
                return $next($request);
            }
        }

        // Save geo tag
        if ($geoIp = Location::get($request->ip())) {
            $geo = $geoIp->countryName;
        } else {
            $geo = 'undefined';
        };

        // Count a visitor if all good
        if (Visitor::where('date', today())->where('ip', $ip)->count() < 1)
---
select * from `links` where `input_url` = 'admin' limit 1
select count(*) as aggregate from `visitor` where `date` = '2021-08-22 00:00:00' and `ip` = '0e85a5aa960e7bed73f789cf62fa29859b32603bce563702942eefa6cb1ee31cdc69637d283aaf4c2cc6ca132ed5389083d26fcc34861694d9314808282450cf'