app/Http/Controllers/DashboardController.php

select * from `users`
select * from `links`
select * from `visitor`
select * from `visitor` where `date` = '2021-08-22 00:00:00'
select `date`, count(*) as total from `visitor` where `date` > '2021-07-22 00:00:00' group by `date`
select * from `clicks`
---
    public function index()
    {
        $ctr = new Controller;
        $admins = $ctr->admins;
        $linkOptions = $ctr->linkOptions;

        $users = User::all();
        $links = Link::all();
        $visitors = Visitor::all();
        $visitorsToday = Visitor::where('date', '=', today())->get();
        $visitorsChart = Visitor::select('date', DB::raw('count(*) as total'))->where('date', '>', today()->subMonth())->groupBy('date')->get();
        $visitorsCount = Visitor::all()->countby('geo');

        $chart_data = array();

        $clicks = Click::all();