app/Http/Controllers/LinkController.php

    public function show($id)
    {
        $link = Link::where('id', $id)->first();
        $stats = Click::where('link', $link->input_url)->get();
---
select * from `links` where `id` = '282' limit 1
select * from `clicks` where `link` = 'kiss_me_1'

    public function redirect(String $slug, Request $request) {
        if ($link = Link::where('input_url', $slug)->first()){
---
select * from `links` where `input_url` = 'my_pics_h6ah4' limit 1