app/Http/Controllers/UserController.php

    public function index() {
        $userEmail = Auth::user()->email;
        $links = Link::select('input_url', 'output_url', 'created_at', 'id')->where('user_id', $userEmail)->get();
---
select `input_url`, `output_url`, `created_at`, `id` from `links` where `user_id` = 'niki4.1995@gmail.com'